#include<stdio.h>
int main3()
{
	int a = 0, b = 0, c = 0, d = 0, e = 0;
	for (a = 1; a <= 5; a++)
	{
		for (b = 1; b <= 5; b++)
		{
			for (c = 1; c <= 5; c++)
			{
				for (d = 1; d <= 5; d++)
				{
					for (e = 1; e <= 5; e++)
					{
						if ((b == 2 && a != 3)|| (b != 2 && a == 3) )
						{
							if ((b == 2 && e != 4) || (b != 2 && e == 4))//话只说对了一半，基本逻辑为(左边为真右边为假)或者(左边为假右边为真)
							{
								if ((c == 1 && d != 2) || (c != 1 && d == 2))//不能用或者来进行条件的真假选择，如果左边暂时为真右边就不会再进行判断
								{
									if ((c == 5 && d != 3) || (c != 5 && d == 3))
									{
										if ((e != 4 && a == 1) || (e == 4 && a != 1))
										{
											if (a* b* c* d* e == 120)//判断abcde中的数字为1.2.3.4.5
											{
												printf("a=%d b=%d c=%d d=%d e=%d", a, b, c, d, e);
											}
										}
									}
								}
							}
						}
					}
				}
			}
		}
	}	
}